#include <stdio.h>

/**
 * @brief Упражнение по программированию 7.10
 *
 * @details В 1988 году шкала федеральных налоговых ставок Соединенных Штатов была самой простой за всё прошедшее время.
 * Она содержала четыре категории, каждая из которых включала две ставки. Ниже приведены самые общие данные (суммы в
 * долларах представляют собой доход, облагаемый налогом)
 * <table>
 *  <thead>
 *    <tr><th>Категория</th><th>Налог</th></tr>
 *  </thead>
 *  <tbody>
 *    <tr>
 *      <td>Одинокий</td>
 *      <td>15% с первых $17850 плюс 28% от суммы, превышающей указанную</td>
 *    </tr>
 *    <tr>
 *      <td>Глава семейства</td>
 *      <td>15% с первых $23900 плюс 28% от суммы, превышающей указанную</td>
 *    </tr>
 *    <tr>
 *      <td>Состоит в браке, совместное ведение хозяйства</td>
 *      <td>15% с первых $29750 плюс 28% от суммы, превышающей указанную</td>
 *    </tr>
 *    <tr>
 *      <td>Состоит в браке, раздельное ведение хозяйства</td>
 *      <td>15% с первых $14875 плюс 28% от суммы, превышающей указанную</td>
 *    </tr>
 *  </tbody>
 * </table>
 * Например, одинокий работник, получающий облагаемый налогом доход в $20000, платит налоги в сумме
 * 0.15х$17850 + 0.28х($20000 - $17850). Напишите программу, которая позволяет пользователю указать категорию и
 * облагаемый налогом доход, после чего вычисляет сумму налога. Используйте цикл, чтобы пользователь мог вводить
 * разные варианты налогообложения.
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
