#include <stdio.h>

/**
 * @brief Упражнение по программированию 7.2
 *
 * @details Напишите программу, которая читает входные данные до тех пор, пока не встретится символ <code>#</code>.
 * Программа должна выводить каждый введенный символ и его десятичный код <code>ASCII</code>. Каждая строка вывода
 * должна содержать восемь пар "символ-код".
 *
 * @note Используйте счетчики символов и операцию деления по модулю (<code>%</code>) для вывода символа новой строки
 * на каждой восьмой итерации цикла.
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
