#include <stdio.h>

/**
 * \brief Напишите программу, выводящую ваше имя и адрес.
 *
 * \return int
 */
int main(void)
{
    printf("Мои имя и фамилия\n");
    printf("Мой адрес\n");

    return 0;
}
