#include <stdio.h>

/**
 * @brief Упражнение по программированию 7.6
 *
 * @details Напишите программу, которая читает входные данные, пока не встретит символ <code>#</code>,
 * и сообщает количество вхождений последовательности <code>ei</code>.
 * 
 * @note Программа должна "запоминать" предыдущий символ, а также текущий символ. Проверьте ее на входной
 * последовательности вроде "Receive your eieio award#".
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
