#include <stdio.h>

/**
 * @brief Упражнение по программированию 8.4
 *
 * @details Напишите программу, которая читает ввод как поток символов, пока не встретит <code>EOF</code>. Программа
 * должна сообщать среднее количество букв в словах. Не считайте пробельные символы в словах буквами. На самом деле, так
 * же не должны учитываться и знаки препинания, но в данном упражнении об этом можно не беспокоиться. (Для учета знаков
 * препинания можно воспользоваться функцией <code>ispunct()</code> из семейства <code>ctype.h</code>.)
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
