#include <stdio.h>

/**
 * @brief Упражнение по программированию 8.5
 *
 * @details Модифицируйте программу угадывания чисел из листинга 8.4, чтобы реализовать более интеллектуальную стратегию
 * угадывания. Например, программа может изначально предложить число 50 и запросить , больше ли оно задуманного, меньше
 * его или же это и есть задуманное число. Если, скажем, предложение меньше задуманного числа, следующая догадка должна
 * находиться посредине между 50 и 100, т.е. 75. Если данное предположение больше задуманного числа, то следующая
 * догадка должна располагаться посредине между 75 и 50 и т.д. Используя такую стратегию <i>двоичного поиска</i>,
 * программа быстро найдет правильный ответ, во всяком случае, если пользователь не будет обманывать.
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
