#include <stdio.h>

/**
 * @brief Упражнение по программированию 9.10
 *
 * @details Обобщите функцию <code>to_binary()</code> из листинга 9.8 до функции <code>to_base_n()</code>, которая
 * принимает второй аргумент в диапазоне от 2 о 10. Она должна выводить число, переданное в первом аргументе, в системе
 * счисления с основанием, которое указанно во втором аргументе. Например, вызов <code>to_base_n(128,8)</code> должен
 * отобразить <code>201</code>, т.е. восьмеричный эквивалент числа <code>129</code>. Протестируйте готовую функцию в
 * какой-нибудь программе.
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
