#include <stdio.h>

/**
 * @brief Упражнение по программированию 7.8
 *
 * @details Измените предположение а) в упражнении 7 так, чтобы программа предоставляла меню с тарифными ставками. Для
 * выбора тарифной ставки используйте оператор <code>switch</code>. После запуска программы вывод должен быть подобным
 * показанному ниже:
 * <pre>
 * ***********************************************************************
 * Введите число, соответствующее желаемой тарифной ставке или действию:<br>
 * 1) $8.75/ч                     2) $9.33/ч<br>
 * 3) $10.00/ч                    4) $11.20/ч<br> 
 * 5) Выход
 * ***********************************************************************
 * </pre>
 * если выбранный вариант с 1 по 4, программа должна запрашивать количество отработанных часов. Программа должна
 * повторяться до тех пор, пока не будет вызван вариант 5. При вводе чего-то отличного от вариантов 1-5 программа
 * должна напомнить пользователю допустимые варианты для ввода и снова ожидать ввод. Для различных тарифных и налоговых
 * ставок применяйте константы <code>#define</code>
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
