#include <stdio.h>

/**
 * @brief Упражнение по программированию 7.7
 *
 * @details Напишите программу, которая запрашивает количество часов, отработанных за неделю, и выводит занечние общей
 * суммы начислений, налогов и чистой зарплаты. Исходите из перечисленных ниже утверждений.
 * <ul>
 * <li>Основная тарифная ставка заработной платы = $10.00/час</li>
 * <li>Сверхурочные часы (превышающие 40 часов в неделю) = коэффициент 1,5</li>
 * <li>Налоговая ставка:<ul>
 * <li>15% с первых $300;</li>
 * <li>20% со следующих $150;</li>
 * <li>25% с остатка.</li>
 * </ul>
 * </li>
 * </ul>
 * Исползуйте константы <code>#define</code> и не беспокойтесь, если приведенный пример не соответствует действующему 
 * нологооблажения.
 * 
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
