#include <stdio.h>

/**
 * @brief Упражнение по программированию 9.8
 *
 * @details В главе 6 была показана функция <code>power()</code> (листинг 6.20), которая возвращает результат возведения
 * числа <code>double</code> в положительную целую степень. Усовершенствуйте эту функцию, чтобы она корректно возводила
 * числа в отрицательные степени. Кроме того, добавьте в функцию возможность оценки как 0 результата возведения 0 в
 * любую степень кроме 0 и оценки как 1 результата возведения любого числа в степень 0. (Функция должна сообщать, что
 * результат возведения 0 в степень 0 не определен и что она использует значение 1.)
 * Примените цикл. Протестируйте функцию в какой-нибудь программе.
 *
 * @return int
 */
int main(void)
{
    /** @todo write your code here */

    return 0;
}
